GetValidTypes Method
Overload List
Name | Description
GetValidTypes
 Obtains a set of types that are valid for this element.
GetValidTypes(Document, ICollectionElementId)
 Obtains a set of types that are valid for all given elements.
See Also
Element Class
Element Members
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →